Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: You may be wondering: why would people spend hours of their own time to write software, carefully package it, and then give it all away? The answers are as varied as the people who contribute. Some people like to help others. Many write programs to learn more about computers. More and more people are looking for ways to avoid the inflated price of software. A growing crowd contribute as a thank you for all the great free software they've received from others. Many in academia create free software to help get the results of their research into wider use. Businesses help maintain free software so they can have a say in how it develops -- there's no quicker way to get a new feature than to implement it yourself! Of course, a lot of us just find it great fun.
pt_pt: Você deve estar pensando: por que as pessoas gastam tantas horas de seu tempo para escrever software, empacotá-lo cuidadosamente e então distribuí-lo? As respostas são tão variadas quanto as pessoas que contribuem. Algumas pessoas gostam de ajudar outras pessoas. Muitas escrevem programas para aprender mais sobre computadores. Mais e mais pessoas estão procurando maneiras de evitar o alto preço de software. Uma multidão crescente contribui como forma de agradecimento por todos os excelentes softwares livres que receberam dos(as) outros(as). Muitas pessoas na academia criam softwares livres a fim de que os resultados de suas pesquisas tenham um uso mais amplo. Empresas ajudam a manter o software livre para que possam opinar na forma como ele é desenvolvido -- não há maneira mais rápida de obter um novo recurso do que implementá-lo você mesmo(a)! Claro, muitos de nós apenas acha tudo isso muito divertido!

source: Debian is so committed to free software that we thought it would be useful if that commitment was formalized in a written document. Thus, our Social Contract was born.
pt_pt: O Debian é tão comprometido com o software livre que decidimos que seria útil que esse compromisso fosse formalizado em um documento escrito. Assim nasceu o nosso contrato social.

source: Although Debian believes in free software, there are cases where people want or need to put non-free software on their machine. Whenever possible Debian will support this. There are even a growing number of packages whose sole job is to install non-free software into a Debian system.
pt_pt: Embora o Debian acredite no software livre, há casos em que as pessoas querem ou precisam colocar software não livre em suas máquinas. Sempre que possível, o Debian dará suporte a esses(as) usuários(as). Há até mesmo um número crescente de pacotes cujo único trabalho é instalar software não livre em sistemas Debian.

source: You say free, but the CDs/bandwidth cost money!
pt_pt: Você diz livre, mas os CDs e a banda de rede custam dinheiro!

source: You might be asking: If the software is free, then why do I have to pay a vendor for a CD, or pay an ISP for downloading?
pt_pt: Você pode estar se perguntando: se o software é livre ("free", em inglês, também significa "grátis"), então por que eu tenho que pagar a um(a) vendedor(a) por um CD ou a um provedor de internet pela conexão para fazer o download do mesmo?

source: When buying a CD, you are paying for someone's time, capital outlay to make the disks, and risk (in case they don't sell them all). In other words, you are paying for a physical medium used to deliver the software, not for the software itself.
pt_pt: Quando você compra um CD, está pagando pelo tempo de alguém, pelo investimento para criar os discos e pelo risco (no caso de todos os CDs não serem vendidos). Em outras palavras, você está pagando por uma mídia física usada para entregar o software, não pelo software em si.

source: When we use the word "free", we are referring to software freedom, not that it's without cost. You can read more on what we mean by "free software" and what the Free Software Foundation says on that subject.
pt_pt: Quando usamos a palavra "free" (livre), estamos nos referindo à liberdade de software, não a custo zero. Você pode ler mais sobre o que consideramos "software livre" e o que a Free Software Foundation diz sobre o assunto.

source: Most software costs over 100 US dollars. How can you give it away?
pt_pt: A maioria dos softwares custa mais de 100 dólares. Como vocês conseguem distribuí-lo assim?

source: A better question is how do software companies get away with charging so much? Software is not like making a car. Once you've made one copy of your software, the production costs to make a million more are tiny (there's a reason Microsoft has so many billions in the bank).
pt_pt: Uma pergunta melhor é: como as empresas de software conseguem cobrar tanto? Desenvolver software não é como fazer um carro. Uma vez feita uma cópia do seu software, os custos de produção para se fazer um milhão de cópias a mais são muito pequenos (essa é uma razão pela qual a Microsoft tem bilhões de dólares no banco).

source: Look at it another way: if you had an endless supply of sand in your backyard, you might be willing to give sand away. It would be foolish, though, to pay for a truck to take it to others. You would make them come and get it themselves (equivalent to downloading off the net) or they can pay someone else to deliver it to their door (equivalent to buying a CD). This is exactly how Debian operates and why most of the CDs/DVDs are so cheap (only about 12 USD for 4 DVDs).
pt_pt: Olhe de outro modo: se você tivesse um suprimento infinito de areia no seu quintal, você iria querer doar essa areia. Mesmo assim, seria idiota pagar para um caminhão levá-la para outras pessoas. Você faria com que essas pessoas viessem buscar sua areia elas mesmas (equivalente a baixar da internet), ou elas podem pagar a alguém para entregar na porta da casa delas (equivalente a comprar um CD). Isso é exatamente o que o Debian faz e essa é a razão dos CDs/DVDs serem tão baratos (por volta de R$10,00 o DVD).

source: Debian does not make any money from the sale of CDs. At the same time, money is needed to pay for expenses such as domain registration and hardware. Thus, we ask that you buy from one of the CD vendors that donates a portion of your purchase to Debian.
pt_pt: O Debian não ganha dinheiro vendendo CDs. Mesmo assim, é necessário dinheiro para pagar despesas como registro de domínio e hardware. Dessa forma, pedimos que você compre as mídias de um dos(as) vendedores(as) de CDs que doam uma parte do valor da venda ao Debian.

source: What hardware is supported?
pt_pt: Qual hardware é suportado?

source: Debian will run on almost all personal computers, including most older models. Each new release of Debian generally supports a larger number of computer architectures. For a complete list of currently supported ones, see the documentation for the stable release.
pt_pt: O Debian pode ser executado em quase todos os computadores pessoais, incluindo os mais antigos. Cada novo lançamento do Debian geralmente suporta um número maior de arquiteturas. Para consultar uma lista completa das arquiteturas atualmente suportadas, leia a documentação da versão estável (stable).

source: Almost all common hardware is supported. If you would like to make sure that all the devices connected to your machine are supported, try the DebianOn wiki page or Hardware for Linux web page.
pt_pt: Quase todo hardware comum é suportado. Se você quer ter certeza de que todos os dispositivos conectados à sua máquina são suportados, confira a página wiki DebianOn or a página web Hardware para Linux.

source: There are a few companies that make support difficult by not releasing specifications for their hardware. This means you might not be able to use their hardware with GNU/Linux. Some companies provide non-free drivers, but that is a problem because the company could later go out of business or stop support for the hardware you have. We recommend that you only purchase hardware from manufacturers that provide free drivers for their products.
pt_pt: Existem algumas empresas que dificultam o suporte ao não liberar as especificações de seu hardware. Isso significa que talvez você não consiga usar o hardware deles com GNU/Linux. Algumas empresas fornecem drivers não livres, mas isso é um problema, pois posteriorment a empresa poderia sair do negócio ou interromper o suporte para o hardware que você possui. Recomendamos que você apenas adquira hardwares de fabricantes que forneçam drivers livres para seus produtos.

source: I'm looking for more information.
pt_pt: Preciso de mais informações.

source: You may want to check out our FAQ.
pt_pt: Você pode dar uma olhada no nosso FAQ.

source: I'm still not convinced.
pt_pt: Ainda não estou convencido(a).

source: Don't take our word for it - try Debian yourself. Since hard disk space has become less expensive, you can probably spare about 2GB. If you don't want or need a graphical desktop, 600MB are sufficient. Debian can be easily installed on this extra space and can coexist with your existing OS. If you eventually need more space, you can simply delete one of your OSes (and after you see the power of a Debian system, we are confident you won't delete Debian).
pt_pt: Não nos dê ouvidos - experimente o Debian você mesmo(a). Já que o espaço em disco tem se tornado cada vez mais barato, você provavelmente pode dispor de 2GB de espaço em disco. Se você não quer ou não precisa de uma interface gráfica, 600MB são suficientes. O Debian pode facilmente ser instalado nesse espaço extra e coexistir com seu sistema operacional atual. Se você eventualmente precisar de mais espaço, pode simplesmente remover um dos seus sistemas operacionais (e depois de ver o poder de um sistema Debian, temos certeza de que você não removerá o Debian).

source: As trying a new operating system will take some of your valuable time, it is understandable that you may have reservations. For this reason we compiled a list of pros and cons of Debian. This should help you decide whether you think it's worth it. We hope you'll appreciate our honesty and frankness.
pt_pt: Experimentar um novo sistema operacional tomará uma boa parte do seu valioso tempo, por isso é compreensível que você possa ter suas reservas. Por essa razão, compilamos uma lista de prós e contras do Debian. Isso deve ajudar na decisão se vale a pena ou não. Esperamos que você aprecie nossa honestidade e franqueza.

source: How do I get Debian?
pt_pt: Como consigo o Debian?

source: It's most popular to install Debian from a CD which you can buy for the price of the media at one of our many CD vendors. If you have good Internet access, you can download and install Debian over the Internet.
pt_pt: O método de instalação do Debian mais popular é através de CDs, os quais você pode adquirir com um(a) dos(as) nossos(as) vários(as) vendedores(as) de CDs. Caso você disponha de bom acesso à Internet, é possível baixar e instalar o Debian pela Internet.

source: Please see our page about getting Debian for more information.
pt_pt: Por favor, consulte nossa página sobre como obter o Debian para mais informações.

source: I can't set it up all by myself. How do I get support for Debian?
pt_pt: Eu não consigo configurar tudo sozinho(a). Como consigo ajuda para o Debian?

source: You can get help by reading the documentation which is available both on the web site and in packages you can install on your system. You can also contact us via the mailing lists or using IRC. One can even hire a consultant to do the work.
pt_pt: Você pode obter ajuda lendo a documentação que está disponível tanto nas páginas do site web quanto nos pacotes que você pode instalar em seu sistema. Você também pode entrar em contato conosco através das listas de discussão ou usando o IRC. É possível ainda contratar consultores(as) para fazer o serviço.

source: Please see our documentation and support pages for more information.
pt_pt: Por favor, veja nossa documentação e páginas de suporte para mais informações.

source: Who are you all anyway?
pt_pt: Afinal de contas, quem são vocês?

source: Debian is produced by almost a thousand active developers spread around the world who volunteer in their spare time. Few of the developers have actually met in person. Communication is done primarily through e-mail (mailing lists at lists.debian.org) and IRC (#debian channel at irc.debian.org).
pt_pt: O Debian é produzido por aproximadamente mil desenvolvedores(as) ativos(as) espalhados(as) pelo mundo que são voluntários(as) em seu tempo livre. Poucos(as) desenvolvedores(as) se conhecem pessoalmente. A comunicação é realizada principalmente através de e-mail (listas de discussão em lists.debian.org) e IRC (canal #debian-br em português, ou #debian em inglês, no irc.debian.org).

source: The Debian Project has a carefully organized structure. For more information on how Debian looks from the inside, please feel free to browse the developers' corner.
pt_pt: O Projeto Debian tem uma estrutura organizada cuidadosamente. Para mais informações sobre como o Debian é internamente, sinta-se livre para navegar pelo canto dos(as) desenvolvedores(as).

source: The complete list of official Debian members can be found on nm.debian.org, where membership is managed. A broader list of Debian contributors can be found on contributors.debian.org.
pt_pt: A lista completa de participantes oficiais do Debian pode ser encontrada em nm.debian.org, onde a comunidade é gerenciada. Uma lista mais ampla de contribuidores(as) do Debian pode ser encontrada em contributors.debian.org.

source: Who uses Debian?
pt_pt: Quem usa o Debian?

source: Although no precise statistics are available (since Debian does not require users to register), evidence is quite strong that Debian is used by a wide range of organizations, large and small, as well as many thousands of individuals. See our Who's using Debian? page for a list of high-profile organizations which have submitted short descriptions of how and why they use Debian.
pt_pt: Embora não exista uma estatística precisa (já que o Debian não exige que usuários(as) se registrem), existem fortes evidências de que o Debian é utilizado por um amplo número de grandes e pequenas organizações, bem como por milhares de pessoas. Veja nossa página quem está usando o Debian? para uma lista de organizações importantes que nos enviaram uma breve descrição de como e porque estão usando o Debian.

source: How'd it all get started?
pt_pt: Como tudo isso começou?

source: Debian was begun in August 1993 by Ian Murdock, as a new distribution which would be made openly, in the spirit of Linux and GNU. Debian was meant to be carefully and conscientiously put together, and to be maintained and supported with similar care. It started as a small, tightly-knit group of Free Software hackers, and gradually grew to become a large, well-organized community of developers and users. See the detailed history.
pt_pt: O Debian foi criado em agosto de 1993 por Ian Murdock, como uma nova distribuição que seria feita abertamente, no espírito do Linux e do projeto GNU. O Debian foi concebido para ser cuidadosamente e conscientemente organizado, e para ser mantido e suportado com cuidado similar. Tudo começou como um pequeno grupo de hackers de Software Livre que, gradativamente, cresceu e tornou-se uma grande e organizada comunidade de desenvolvedores(as) e usuários(as). Veja a história detalhada.

source: Since many people have asked, Debian is pronounced /ˈde.bi.ən/. It comes from the names of the creator of Debian, Ian Murdock, and his wife, Debra.
pt_pt: Já que muitas pessoas perguntam, Debian é pronunciado /ˈde.bi.ən/. O nome vem do nome de seu criador, Ian Murdock, e sua esposa, Debra.

source: عربية (Arabiya) Български (Bəlgarski) català česky dansk Deutsch Ελληνικά (Ellinika) español français Galego hrvatski Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) norsk (bokmål) polski Português română Русский (Russkij) slovenčina suomi svenska Tiếng Việt Türkçe українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)
pt_pt: عربية (Arabiya) Български (Bəlgarski) català česky dansk Deutsch Ελληνικά (Ellinika) English español français Galego hrvatski Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) norsk (bokmål) polski română Русский (Russkij) slovenčina suomi svenska Tiếng Việt Türkçe українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Fri, Dec 29 01:48:52 UTC 2023 Last Built: Tue, Aug 6 19:47:22 UTC 2024
pt_pt: Última Modificação: Seg, 8 de Abr de 2024, 18:44:21 UTC Última compilação: Ter, 6 de Ago de 2024, 22:07:04 UTC

source: Copyright © 1997-2023 SPI and others; See license terms
pt_pt: Copyright © 1997-2024 SPI e outros; Veja os termos de licença

source: What does free mean?
pt_pt: O que significa livre?

source: · Free as in...?
pt_pt: · Livre como em...?

source: · Software Licenses
pt_pt: · Licenças de software

source: · How to choose a License?
pt_pt: · Como escolher uma licença?

source: In February 1998, a group of people moved to replace the term Free Software with Open Source Software.
pt_pt: Em fevereiro de 1998, um grupo se mobilizou para substituir o termo "Software Livre" por "Software de Código Aberto".

source: The terminology debate reflects the underlying philosophical differences, but the practical requirements as well as other things discussed on this site are essentially the same for Free Software and Open Source Software.
pt_pt: O debate sobre a terminologia reflete as diferenças filosóficas fundamentais, mas os requisitos práticos, bem como outras coisas discutidas neste site, são essencialmente os mesmos para o Software Livre e o Software de Código Aberto.

source: Free as in...?
pt_pt: Livre como em...?

source: Many people new to this subject are confused because of the word "free".
pt_pt: Muitas pessoas novas nesse assunto ficam confusas por causa da palavra "free".

source: It isn't used the way they expect – "free" means "free of cost" to them.
pt_pt: A palavra não é usada da forma que elas esperam – "free" significa "sem custo" para elas.

source: If you look at an English dictionary, it lists almost twenty different meanings for "free", and only one of them is "at no cost".
pt_pt: Se você olhar no dicionário de inglês, ele lista quase vinte significados para a palavra "free" e apenas uma delas é "sem custo".

source: The rest refer to "liberty" and "lack of constraint".
pt_pt: O resto se refere à "liberdade" e "falta de restrição".

source: So, when we speak of Free Software, we mean freedom, not payment.
pt_pt: Então, quando falamos de Free Software (Software Livre), nos referimos à liberdade, não ao pagamento.

source: Software described as free, but only in the sense that you don't need to pay for it, is hardly free at all, You may be forbidden to pass it on, and you're most certainly not allowed to modify it.
pt_pt: O software descrito como livre, mas apenas no sentido de não ter que pagar por ele, dificilmente é livre como um todo. Você pode ser impedido(a) de passá-lo adiante e certamente será impedido(a) de modificá-lo.

source: Software licensed at no cost is usually a weapon in a marketing campaign to promote a related product or to drive a smaller competitor out of business.
pt_pt: O software licenciado sem custo é normalmente uma arma em uma campanha de marketing para promover um produto relacionado ou para tirar um competidor menor do mercado.

source: There is no guarantee that it will stay free of charge.
pt_pt: Não há garantia de que ele permanecerá livre de cobrança.

source: To the uninitiated, software is either free or it isn't.
pt_pt: Para os(as) não iniciados(as), o software é gratuito ou não é.

source: Real life is much more complicated than that, though.
pt_pt: No entanto, a vida real é muito mais complicada do que isso.

source: To understand what people imply when they speak about free software, let's take a little detour and enter the world of software licenses.
pt_pt: Para entender o que as pessoas querem dizer quando falam de software livre, vamos pegar um pequeno desvio e entrar no mundo das licenças de software.

source: Software Licenses
pt_pt: Licenças de software

source: Copyrights are one method of protecting the creators' rights of certain types of work.
pt_pt: Os direitos autorais (copyrights) são um método para proteger os direitos do(a) criador(a) de certos tipos de trabalhos.

source: In most countries, newly written software is automatically copyrighted.
pt_pt: Na maioria dos países, software recém-escrito é automaticamente protegido por direitos autorais.

source: A license is the author's way of allowing others to use his or her creation (software in this case), in ways that are acceptable to them.
pt_pt: Uma licença é a maneira dos(as) autores(as) permitirem o uso de sua criação (software nesse caso) por outras pessoas, de maneiras aceitáveis para eles(as).

source: It's up to the author to include a license which declares how a piece of software may be used.
pt_pt: Cabe ao(à) autor(a) incluir uma licença que declare como um pedaço do software pode ser usado.

source: Read more about copyright
pt_pt: Leia mais sobre direito autoral (copyright)

source: Of course, different circumstances call for different licenses.
pt_pt: Claro, diferentes circunstâncias exigem diferentes licenças.

source: Software companies are looking for ways to protect their assets, so they often release only compiled code which isn't human readable.
pt_pt: As empresas de software estão procurando proteger seus bens, por isso elas liberam apenas o código compilado que não é legível por humanos.

source: They also put many restrictions on the use of the software.
pt_pt: Elas também colocam muitas restrições para o uso do software.

source: Authors of free software, on the other hand, are mostly looking for different rules, sometimes even a combination of the following points:
pt_pt: Os(As) autores(as) de software livre, por outro lado, estão geralmente procurando por regras diferentes, às vezes até mesmo uma combinação dos seguintes pontos:

source: · It's not allowed to use their code in proprietary software.
pt_pt: · Não é permitido o uso de seu código em software proprietário.

source: Since they release their software so that everyone may use it, they don't want to see others steal it.
pt_pt: Já que eles(as) lançam seu software para que todos(as) possam usá-lo, eles(as) não querem ver outros(as) o(a) roubando.

source: In this case, use of the code is seen as a trust: you may use it, as long as you play by the same rules.
pt_pt: Nesse caso, o uso do código é visto como uma confiança: você pode usá-lo desde que jogue com as mesmas regras.

source: · The authorship's identity must be protected.
pt_pt: · A identidade de autoria deve ser protegida.

source: People take great pride in their work and don't want others to remove their names from the credits or even claim they wrote it themselves.
pt_pt: As pessoas têm um grande orgulho de seu trabalho e não querem que outros(as) removam seu nome dos créditos ou até mesmo que afirmem que foram eles(as) próprios(as) que escreveram o software.

source: · Source code must be distributed.
pt_pt: · O código-fonte deve ser distribuído.

source: One major problem with proprietary software is that you can't fix bugs or customize it, since the source code is not available.
pt_pt: Um dos problemas com a maioria do software proprietário é que você não pode consertar erros ou customizá-lo, já que o código-fonte não está disponível.

source: Also, a vendor may decide to stop supporting the users' hardware.
pt_pt: Além disso, um fornecedor pode decidir parar de dar suporte ao hardware do(a) usuário(a).
